Revit 2024 API
WorksetId Class
 WorksetId identifies a workset within a single document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class WorksetId
Visual Basic
Public Class WorksetId
Visual C++
public ref class WorksetId
Remarks
 WorksetId is not guaranteed to be unique. It is only valid within one model and its value may change when the model is synchronized with central. If unique identification of a workset is needed, the workset's GUID should be used instead.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.WorksetId
See Also
WorksetId Members
Autodesk.Revit.DB Namespace